000010     IDENTIFICATION DIVISION.
000020     PROGRAM-ID. hello.
000030     PROCEDURE DIVISION.
000040     DISPLAY "Hello World!".
000050     STOP RUN.
